import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id="selfIntro">
      <div class="division">
        <h1>자기 소개서</h1>
        <p>
          &nbsp;&nbsp;어릴 적부터 잘 따르던 형이 컴퓨터에 관심을 가지고 컴퓨터공학과에 진학하는 모습을 봐 왔습니다.
          소프트웨어 개발에 흥미를 갖게 된 계기는 형의 졸업 작품을 접하고 그 시스템에 재미를 느끼면서부터였습니다.
          아두이노를 활용한 지문 인식 보안 장치였는데 당시 대학 전공을 선택하지 못했던 상황에서 소프트웨어에 대해
          상당한 매력을 느끼게 되었습니다. 그 후 컴퓨터소프트웨어 전공으로 진로를 정하여 소프트웨어 개발자를 목표로
          지식을 쌓아 왔습니다. 하지만 대학교 1학년 재학 기간 동안 진로에 대해 잠시 방황하던 시기가 있었습니다.
          소프트웨어 개발에 뛰어들기 위해 배워야 할 분야는 넓었고 전공 지식을 습득하는 과정도 힘겨웠습니다.
          그 후 군 입대를 하고 진로와 인생에 대한 생각을 소프트웨어 개발직에 종사하는 동기와 공유하며
          소프트웨어에 대한 비전과 논리적 사고에 자신 있던 저를 발견하였습니다. 전역 후에는 소홀했던
          성적 관리에 대해 꼼꼼하고 성실히 임하여 좋은 성적을 받을 수 있게 되었습니다.
        </p>
      </div>
      <br /><br /><br /><br />
      <div class="division">
        <h1>장점 및 특기사항</h1>
        <p>
          &nbsp;&nbsp;일의 완성도를 높이기 위해서는 몰입과 책임감이 중요하다고 생각합니다. <br />
          저는 관심이 적거나 수동적으로 맡은 업무라도 해결하는 과정에서 작은 성취를 느끼며 자연스럽게
          몰입하는 특성이 있습니다. 그리고 프로젝트팀장을 맡아 책임감의 중요성을 느낀 경험이 있었습니다.
          프로젝트 주제를 선정하고 개발 분야를 나눠 본격적인 개발이 시작되었지만 한 명의 팀원이
          갑작스럽게 프로젝트에서 빠지게 되었습니다. 팀이 해체될 위기에 처해있었지만 앞서 개발 주제
          선정에 저의 의견을 믿고 동의해 준 팀원들에게 고마움을 느꼈었습니다. 고마움은 프로젝트와
          팀원들에 대한 책임감으로 전환되어 다시 팀을 이끌어가야 한다는 의지를 만들어 냈습니다.
          그 후 적극 팀원들을 설득하여 다시 효율적으로 분야를 나눠 개발에 착수하고 완만하게 프로젝트를
          마치게 되었습니다.
        </p>
      </div>
      <br /><br /><br /><br />
      <div class="division">
        <h1>특기</h1>
        <p>
          &nbsp;&nbsp;자동차 SW에 대한 QA 및 테스트 업무는 꼼꼼함과 책임감이 중요하다고 생각합니다.<br />
          자동차 소프트웨어는 운전자에게 자동차 제어에 대한 편의를 제공해 줄 뿐만 아니라
          최적의 내비게이션 경로 설정으로 시간적인 효율을 가져다줍니다. 이러한 점에서 소프트웨어의
          정교함과 오류를 방지하는 테스트가 사용자의 편의에 직결된다고 생각합니다. 저는 1년 6개월
          동안 고깃집 계산업무와 서빙을 맡은 아르바이트 경험이 있습니다. 일 처리가 빠르지는 않았지만
          완벽함을 추구하고 꼼꼼함을 지향하기 때문에 기기의 입력 실수를 한 적이 없었습니다.
          그리고 고객들의 클레임 해결에도 적극 나서서 책임감을 인정받아 보너스를 받은 경험도 있었습니다.
          결과적으로 저의 특성과 성격이 QA 및 테스트 업무에 대해 특화되어 있다고 생각하고 입사하게 된다면
          저의 장점들이 MSTC에 도움이 될 것으로 생각합니다.
        </p>

      </div>
      <br /><br /><br />
    </div>
  );
};

export default SelfIntro;